microhal/microhal/microhal/ports/stmCommon/registers/peripheralBaseAddressDefinitions/registersBaseAddressDefinitions_stm32l4r7.h
#ifndef _MICROHAL_REGISTERS_BASE_ADDRESS_DEFINITIONS_STM32L4R7_H_
#define _MICROHAL_REGISTERS_BASE_ADDRESS_DEFINITIONS_STM32L4R7_H_

#define _MICROHAL_DAC_BASE_ADDRESS 0x40007400
#define _MICROHAL_DMA1_BASE_ADDRESS 0x40020000
#define _MICROHAL_DMA2_BASE_ADDRESS 0x40020400
#define _MICROHAL_CRC_BASE_ADDRESS 0x40023000
#define _MICROHAL_LTCD_BASE_ADDRESS 0x40016800
#define _MICROHAL_TSC_BASE_ADDRESS 0x40024000
#define _MICROHAL_IWDG_BASE_ADDRESS 0x40003000
#define _MICROHAL_WWDG_BASE_ADDRESS 0x40002C00
#define _MICROHAL_COMP_BASE_ADDRESS 0x40010200
#define _MICROHAL_FIREWALL_BASE_ADDRESS 0x40011C00
#define _MICROHAL_I2C1_BASE_ADDRESS 0x40005400
#define _MICROHAL_I2C2_BASE_ADDRESS 0x40005800
#define _MICROHAL_I2C3_BASE_ADDRESS 0x40005C00
#define _MICROHAL_I2C4_BASE_ADDRESS 0x40008400
#define _MICROHAL_FLASH_BASE_ADDRESS 0x40022000
#define _MICROHAL_DBGMCU_BASE_ADDRESS 0xE0042000
#define _MICROHAL_OCTOSPI1_BASE_ADDRESS 0xA0001000
#define _MICROHAL_OCTOSPI2_BASE_ADDRESS 0xA0001400
#define _MICROHAL_RCC_BASE_ADDRESS 0x40021000
#define _MICROHAL_PWR_BASE_ADDRESS 0x40007000
#define _MICROHAL_SYSCFG_BASE_ADDRESS 0x40010000
#define _MICROHAL_DFSDM1_BASE_ADDRESS 0x40016000
#define _MICROHAL_RNG_BASE_ADDRESS 0x50060800
#define _MICROHAL_AES_BASE_ADDRESS 0x50060000
#define _MICROHAL_ADC_BASE_ADDRESS 0x50040000
#define _MICROHAL_ADC_COMMON_BASE_ADDRESS 0x50040300
#define _MICROHAL_GPIOA_BASE_ADDRESS 0x48000000
#define _MICROHAL_GPIOB_BASE_ADDRESS 0x48000400
#define _MICROHAL_GPIOC_BASE_ADDRESS 0x48000800
#define _MICROHAL_GPIOD_BASE_ADDRESS 0x48000C00
#define _MICROHAL_GPIOE_BASE_ADDRESS 0x48001000
#define _MICROHAL_GPIOF_BASE_ADDRESS 0x48001400
#define _MICROHAL_GPIOG_BASE_ADDRESS 0x48001800
#define _MICROHAL_GPIOH_BASE_ADDRESS 0x48001C00
#define _MICROHAL_GPIOI_BASE_ADDRESS 0x48002000
#define _MICROHAL_SAI1_BASE_ADDRESS 0x40015400
#define _MICROHAL_SAI2_BASE_ADDRESS 0x40015800
#define _MICROHAL_TIM2_BASE_ADDRESS 0x40000000
#define _MICROHAL_TIM3_BASE_ADDRESS 0x40000400
#define _MICROHAL_TIM4_BASE_ADDRESS 0x40000800
#define _MICROHAL_TIM5_BASE_ADDRESS 0x40000C00
#define _MICROHAL_TIM15_BASE_ADDRESS 0x40014000
#define _MICROHAL_TIM16_BASE_ADDRESS 0x40014400
#define _MICROHAL_TIM17_BASE_ADDRESS 0x40014800
#define _MICROHAL_TIM1_BASE_ADDRESS 0x40012C00
#define _MICROHAL_TIM8_BASE_ADDRESS 0x40013400
#define _MICROHAL_TIM6_BASE_ADDRESS 0x40001000
#define _MICROHAL_TIM7_BASE_ADDRESS 0x40001400
#define _MICROHAL_LPTIM1_BASE_ADDRESS 0x40007C00
#define _MICROHAL_LPTIM2_BASE_ADDRESS 0x40009400
#define _MICROHAL_USART1_BASE_ADDRESS 0x40013800
#define _MICROHAL_USART2_BASE_ADDRESS 0x40004400
#define _MICROHAL_USART3_BASE_ADDRESS 0x40004800
#define _MICROHAL_UART4_BASE_ADDRESS 0x40004C00
#define _MICROHAL_UART5_BASE_ADDRESS 0x40005000
#define _MICROHAL_LPUART1_BASE_ADDRESS 0x40008000
#define _MICROHAL_SPI1_BASE_ADDRESS 0x40013000
#define _MICROHAL_SPI2_BASE_ADDRESS 0x40003800
#define _MICROHAL_SPI3_BASE_ADDRESS 0x40003C00
#define _MICROHAL_SDMMC1_BASE_ADDRESS 0x50062400
#define _MICROHAL_EXTI_BASE_ADDRESS 0x40010400
#define _MICROHAL_VREFBUF_BASE_ADDRESS 0x40010030
#define _MICROHAL_CAN1_BASE_ADDRESS 0x40006400
#define _MICROHAL_RTC_BASE_ADDRESS 0x40002800
#define _MICROHAL_OTG_FS_GLOBAL_BASE_ADDRESS 0x50000000
#define _MICROHAL_OTG_FS_HOST_BASE_ADDRESS 0x50000400
#define _MICROHAL_OTG_FS_DEVICE_BASE_ADDRESS 0x50000800
#define _MICROHAL_OTG_FS_PWRCLK_BASE_ADDRESS 0x50000E00
#define _MICROHAL_SWPMI1_BASE_ADDRESS 0x40008800
#define _MICROHAL_OPAMP_BASE_ADDRESS 0x40007800
#define _MICROHAL_FMC_BASE_ADDRESS 0xA0000000
#define _MICROHAL_NVIC_BASE_ADDRESS 0xE000E100
#define _MICROHAL_CRS_BASE_ADDRESS 0x40006000
#define _MICROHAL_DCMI_BASE_ADDRESS 0x50050000
#define _MICROHAL_HASH_BASE_ADDRESS 0x50060400
#define _MICROHAL_DMA2D_BASE_ADDRESS 0x4002B000
#define _MICROHAL_DSI_BASE_ADDRESS 0x40016C00
#define _MICROHAL_GFXMMU_BASE_ADDRESS 0x4002C000
#define _MICROHAL_OCTOSPIM_BASE_ADDRESS 0x50061C00
#define _MICROHAL_FPU_BASE_ADDRESS 0xE000EF34
#define _MICROHAL_MPU_BASE_ADDRESS 0xE000ED90
#define _MICROHAL_STK_BASE_ADDRESS 0xE000E010
#define _MICROHAL_SCB_BASE_ADDRESS 0xE000ED00
#define _MICROHAL_NVIC_STIR_BASE_ADDRESS 0xE000EF00
#define _MICROHAL_FPU_CPACR_BASE_ADDRESS 0xE000ED88
#define _MICROHAL_SCB_ACTRL_BASE_ADDRESS 0xE000E008

#endif // _MICROHAL_REGISTERS_BASE_ADDRESS_DEFINITIONS_STM32L4R7_H_
